app/views/players/show.html.slim

h1 align="center"
  ="#{@player.name} - #{@player.games.pluck(:team).uniq.to_sentence}"
---
SELECT "games"."team" FROM "games" WHERE "games"."player_id" = $1 ORDER BY game_day DESC  [["player_id", 452]]

  tbody
    - @player.games.each do |game|
---
SELECT "games".* FROM "games" WHERE "games"."player_id" = $1 ORDER BY "games"."id" ASC LIMIT 1  [["player_id", 451]]

javascript:
  $(function() {
    renderChart("fanduel-points", "Fanduel Points", #{@player.games.reverse.collect {|game| (game.fanduel_points) }});
  });
---
SELECT "games"."fanduel_points" FROM "games" WHERE "games"."player_id" = $1 ORDER BY game_day DESC  [["player_id", 451]]