app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games" ORDER BY game_day DESC

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "fanduel_points", "game_day", "player_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 05 Apr 2014 21:34:43 UTC +00:00], ["fanduel_points", 30.5], ["game_day", Sat, 05 Apr 2014], ["player_id", 451], ["updated_at", Sat, 05 Apr 2014 21:34:43 UTC +00:00]]

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "fanduel_points" = $1, "minutes" = $2, "rotowire_fdp" = $3, "numberfire_fdp" = $4, "game_day" = $5, "updated_at" = $6 WHERE "games"."id" = 16  [["fanduel_points", 47.9], [nil, 49.3667], [nil, 42.4], [nil, 43.65], ["game_day", Fri, 10 Jan 2014], ["updated_at", Sat, 05 Apr 2014 22:34:12 UTC +00:00]]

  def destroy
    @game.destroy
---
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 1]]

    def set_game
      @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 ORDER BY game_day DESC LIMIT 1  [["id", "8"]]