app/controllers/players_controller.rb

  def index
    unless params[:sort]
      params[:sort] = "fdp_per_36"
      params[:direction] = "desc"
    end

    #@players = Player.all.sort! { |a,b| a.send(params[:sort]) <=> a.send(params[:sort]) }
    @players = Player.all.paginate(:page => params[:page])
    if params[:name]
      player = Player.find_by_name(params[:name])
---
SELECT "players".* FROM "players" WHERE (name LIKE '%yard%')
SELECT COUNT(*) FROM "players"
SELECT "players".* FROM "players" WHERE "players"."name" = 'Lebron' LIMIT 1

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 11 May 2014 16:09:30 UTC +00:00], ["name", "Melvin Ely"], ["updated_at", Sun, 11 May 2014 16:09:30 UTC +00:00]]

    def set_player
      @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", "451"]]